Revit 2024 API
DockablePaneProviderData Constructor
Initializes a new instance of the DockablePaneProviderData class
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public DockablePaneProviderData()
Visual Basic
Public Sub New
Visual C++
public:
DockablePaneProviderData()
See Also
DockablePaneProviderData Class
Autodesk.Revit.UI Namespace